[
  {
    "id": 1,
    "slug": "on-the-efficiency-of-consensus-algorithms-in-dynamic-networks",
    "title": "On the Efficiency of Consensus Algorithms in Dynamic Networks",
    "authors": "Twisha Patel, Co-authors",
    "year": 2024,
    "abstract": "This paper explores consensus mechanisms in networks with changing topologies, proposing optimizations for fault tolerance and performance.",
    "link": "#",
    "content": "# On the Efficiency of Consensus Algorithms in Dynamic Networks\n\nThis work studies consensus algorithms under dynamic topologies. We analyze worst-case and average-case behavior, and propose optimizations to tolerate transient partitions.\n"
  },
  {
    "id": 2,
    "slug": "reproducibility-in-computational-research-a-case-study",
    "title": "Reproducibility in Computational Research: A Case Study",
    "authors": "Twisha Patel",
    "year": 2023,
    "abstract": "An analysis of reproducibility challenges in computational experiments, with practical guidelines for researchers.",
    "link": "#",
    "content": "# Reproducibility in Computational Research: A Case Study\n\nThis case study documents the reproducibility challenges we encountered and the solutions that helped us produce stable, sharable computational results. Includes Docker, notebooks, and CI patterns.\n"
  }
 ,
  {
    "id": 3,
    "slug": "enhancing-fairness-and-interpretability-in-eeg-ptsd-diagnosis-xai",
    "title": "Enhancing Fairness and Interpretability in Electroencephalogram-Based Post-Traumatic Stress Disorder Diagnosis with Explainable AI",
    "authors": "Twisha Patel, Co-authors",
    "year": 2025,
    "abstract": "Pioneering the use of Explainable AI (XAI) in EEG analysis for transparent PTSD diagnosis; identified a critical neurophysiological biomarker and conducted fairness analysis across demographics.",
    "link": "#",
    "content": "# Enhancing Fairness and Interpretability in EEG-Based PTSD Diagnosis with XAI\n\nPioneered the use of Explainable AI (XAI) in Electroencephalogram (EEG) analysis to transform Post-Traumatic Stress Disorder (PTSD) diagnosis into a transparent and trustworthy process.\n\nIdentified a critical neurophysiological biomarker for PTSD: Beta Power Spectral Density in the Right Primary Motor Cortex, linking the disorder directly to heightened arousal and sensory impairments.\n\nConducted a thorough Fairness Analysis on the diagnostic framework, exposing significant demographic biases across groups (sex, education) and establishing a necessity for equitable AI in psychiatric healthcare.\n\n## Contributions\n- Applied XAI techniques to EEG features to produce human-interpretable explanations.\n- Discovered Beta PSD in the Right Primary Motor Cortex as a discriminative biomarker for PTSD.\n- Performed fairness audits across demographic groups and proposed mitigation strategies to reduce bias.\n"
  }
]